# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [3]:
data1 = pd.Series(np.random.randint(1, 5, size=100))
data2 = pd.Series(np.random.randint(1, 4, size = 100))
data3 = pd.Series(np.random.randint(10000, 30001, size = 100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [7]:
df = pd.concat([data1, data2, data3], axis = 1)

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [12]:
df.rename(columns = {0: 'beders', 1: 'bathrs', 2:'price_sqr_metr'}, inplace=True)
df.head()

   beders  bathrs  price_sqr_metr
0       2       1           27829
1       4       3           25465
2       4       3           14484
3       4       2           10343
4       1       1           22968

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [18]:
df1 = pd.concat([data1,data2,data3], axis=0)
df1 = df1.to_frame()
df1

        0
0       2
1       4
2       4
3       4
4       1
..    ...
95  21918
96  20974
97  15979
98  26326
99  14560

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [19]:
df1.shape

(300, 1)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [20]:
df1.reset_index(drop=True, inplace=True)
df1

         0
0        2
1        4
2        4
3        4
4        1
..     ...
295  21918
296  20974
297  15979
298  26326
299  14560

[300 rows x 1 columns]